Revit 2026 API

# TemporaryGraphicsManager Class

---

A class that provides functionality to create temporary graphics in a Revit model.

SystemObject Autodesk.Revit.DBTemporaryGraphicsManager

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TemporaryGraphicsManager : IDisposable
```
```vb
Public Class TemporaryGraphicsManager
	Implements IDisposable
```
```cpp
public ref class TemporaryGraphicsManager : IDisposable
```
```fsharp
type TemporaryGraphicsManager =
    class
        interface IDisposable
    end
```

The TemporaryGraphicsManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddControl | Creates an in-canvas control. |
|  | Clear | Clear all temporary graphics objects managed by this manager. |
|  | Dispose | Releases all resources used by the TemporaryGraphicsManager |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAll | Returns all temporary graphics object indexes managed by this manager. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTemporaryGraphicsManager | Gets a TemporaryGraphicsManager reference of the document. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveControl | Deletes the existing control identified by the unique index. |
|  | SetTooltip | Sets the tooltip for the temporary graphics object. |
|  | SetVisibility | Changes the visibility of temporary graphics object. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UpdateControl | Updates the in-canvas control identified by the unique index. |

The graphics created by this class are temporary or transient. They are not subject to undo and are not saved. It's caller's responsiblity to manage their lifetime, creation and destruction, though Revit will destroy all of them when closing the model.

#### Reference

Autodesk.Revit.DB Namespace